FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf51_erratas.h
                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x07ul:
                        return false;

                    case 0x08ul:
                        return false;

                    case 0x09ul:
                        return false;

                    case 0x0Aul:
                        return false;

                    case 0x0Bul:
                        return false;

                    case 0x0Cul:
                        return false;

                    case 0x0Dul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 ) */
        return false;
    #endif /* ifndef NRF51_SERIES */
}

/* ========= Errata 20 ========= */
#if    defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
    #define NRF51_ERRATA_20_PRESENT    1
#else
    #define NRF51_ERRATA_20_PRESENT    0
#endif

#ifndef NRF51_ERRATA_20_ENABLE_WORKAROUND
    #define NRF51_ERRATA_20_ENABLE_WORKAROUND    NRF51_ERRATA_20_PRESENT
#endif

static bool nrf51_errata_20( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )

            if( var1 == 0x01 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x07ul:
                        return false;

                    case 0x08ul:
                        return false;

                    case 0x09ul:
                        return false;

                    case 0x0Aul:
                        return false;

                    case 0x0Bul:
                        return false;

                    case 0x0Cul:
                        return false;

                    case 0x0Dul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 ) */
        return false;
    #endif /* ifndef NRF51_SERIES */
}

/* ========= Errata 21 ========= */
#if    defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
    #define NRF51_ERRATA_21_PRESENT    1
#else
    #define NRF51_ERRATA_21_PRESENT    0
#endif

#ifndef NRF51_ERRATA_21_ENABLE_WORKAROUND
    #define NRF51_ERRATA_21_ENABLE_WORKAROUND    NRF51_ERRATA_21_PRESENT
#endif

static bool nrf51_errata_21( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )

            if( var1 == 0x01 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x07ul:
                        return false;

                    case 0x08ul:
                        return false;

                    case 0x09ul:
                        return false;

                    case 0x0Aul:
                        return false;

                    case 0x0Bul:
                        return false;

                    case 0x0Cul:
                        return false;

                    case 0x0Dul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 ) */
        return false;
    #endif /* ifndef NRF51_SERIES */
}

/* ========= Errata 22 ========= */
#if    defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
    #define NRF51_ERRATA_22_PRESENT    1
#else
    #define NRF51_ERRATA_22_PRESENT    0
#endif

#ifndef NRF51_ERRATA_22_ENABLE_WORKAROUND
    #define NRF51_ERRATA_22_ENABLE_WORKAROUND    NRF51_ERRATA_22_PRESENT
#endif

static bool nrf51_errata_22( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )

            if( var1 == 0x01 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

