FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf51_erratas.h
                    case 0x03ul:
                        return false;

                    case 0x04ul:
                        return true;

                    case 0x07ul:
                        return false;

                    case 0x08ul:
                        return false;

                    case 0x09ul:
                        return false;

                    case 0x0Aul:
                        return false;

                    case 0x0Bul:
                        return false;

                    case 0x0Cul:
                        return false;

                    case 0x0Dul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 ) */
        return false;
    #endif /* ifndef NRF51_SERIES */
}

/* ========= Errata 50 ========= */
#define NRF51_ERRATA_50_PRESENT                  0

#ifndef NRF51_ERRATA_50_ENABLE_WORKAROUND
    #define NRF51_ERRATA_50_ENABLE_WORKAROUND    NRF51_ERRATA_50_PRESENT
#endif

static bool nrf51_errata_50( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 51 ========= */
#define NRF51_ERRATA_51_PRESENT                  0

#ifndef NRF51_ERRATA_51_ENABLE_WORKAROUND
    #define NRF51_ERRATA_51_ENABLE_WORKAROUND    NRF51_ERRATA_51_PRESENT
#endif

static bool nrf51_errata_51( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 52 ========= */
#define NRF51_ERRATA_52_PRESENT                  0

#ifndef NRF51_ERRATA_52_ENABLE_WORKAROUND
    #define NRF51_ERRATA_52_ENABLE_WORKAROUND    NRF51_ERRATA_52_PRESENT
#endif

static bool nrf51_errata_52( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 53 ========= */
#define NRF51_ERRATA_53_PRESENT                  0

#ifndef NRF51_ERRATA_53_ENABLE_WORKAROUND
    #define NRF51_ERRATA_53_ENABLE_WORKAROUND    NRF51_ERRATA_53_PRESENT
#endif

static bool nrf51_errata_53( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 54 ========= */
#define NRF51_ERRATA_54_PRESENT                  0

#ifndef NRF51_ERRATA_54_ENABLE_WORKAROUND
    #define NRF51_ERRATA_54_ENABLE_WORKAROUND    NRF51_ERRATA_54_PRESENT
#endif

static bool nrf51_errata_54( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 55 ========= */
#if    defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
    #define NRF51_ERRATA_55_PRESENT    1
#else
    #define NRF51_ERRATA_55_PRESENT    0
#endif

#ifndef NRF51_ERRATA_55_ENABLE_WORKAROUND
    #define NRF51_ERRATA_55_ENABLE_WORKAROUND    NRF51_ERRATA_55_PRESENT
#endif

static bool nrf51_errata_55( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )

            if( var1 == 0x01 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return false;

                    case 0x03ul:
                        return true;

                    case 0x04ul:
                        return false;

                    case 0x07ul:
                        return false;

                    case 0x08ul:
                        return false;

                    case 0x09ul:
                        return false;

                    case 0x0Aul:
                        return false;

                    case 0x0Bul:
                        return false;

                    case 0x0Cul:
                        return false;

                    case 0x0Dul:
                        return false;

                    default:
                        return false;
                }
            }
        #endif /* if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 ) */
        return false;
    #endif /* ifndef NRF51_SERIES */
}

/* ========= Errata 56 ========= */
#if    defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 ) \
    || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
    #define NRF51_ERRATA_56_PRESENT    1
#else
    #define NRF51_ERRATA_56_PRESENT    0
#endif

#ifndef NRF51_ERRATA_56_ENABLE_WORKAROUND
    #define NRF51_ERRATA_56_ENABLE_WORKAROUND    NRF51_ERRATA_56_PRESENT
#endif

static bool nrf51_errata_56( void )
{
    #ifndef NRF51_SERIES
        return false;
    #else
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )
            uint32_t var1 = ( ( *( uint32_t * ) 0xF0000FE0ul ) & 0x000000FFul );
            uint32_t var2 = ( ( *( uint32_t * ) 0xF0000FE8ul ) & 0x000000F0ul ) >> 4;
        #endif
        #if defined( NRF51422_XXAA ) || defined( DEVELOP_IN_NRF51422 ) \
        || defined( NRF51422_XXAB ) || defined( DEVELOP_IN_NRF51422 )  \
        || defined( NRF51422_XXAC ) || defined( DEVELOP_IN_NRF51422 )

            if( var1 == 0x01 )
            {
                switch( var2 )
                {
                    case 0x00ul:
                        return true;

                    case 0x01ul:
                        return true;

                    case 0x02ul:
                        return true;

